assets/openfoam-case-template/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (-0.4 -0.3 -0.3)
    (0.6 -0.3 -0.3)
    (0.6 0.3 -0.3)
    (-0.4 0.3 -0.3)

    (-0.4 -0.3 0.3)
    (0.6 -0.3 0.3)
    (0.6 0.3 0.3)
    (-0.4 0.3 0.3)

);


blocks
(
    hex (0 1 2 3 4 5 6 7)
    (50 30 30)
    simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }
    walls
    {
        type wall;
        faces
        (
            (2 3 6 7) //Left wall
            (0 1 5 4) //Right wall
        );
    }
    front
    {
        type wall;
        faces
        (
            (3 2 1 0) //Lower wall
        );
    }
    back
    {
        type wall;
        faces
        (
            (4 5 6 7) //Upper wall
        );
    }
);


// ************************************************************************* //
